# RampAttrLeftBalusterAttachPt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RampAttrLeftBalusterAttachPt Property
ParameterTypeId Class See Also
---
"Left Baluster Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RampAttrLeftBalusterAttachPt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampAttrLeftBalusterAttachPt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RampAttrLeftBalusterAttachPt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace